UNK,-1
the,51405
to,27359
of,27326
in,22034
and,18983
said,18845
a,18682
mln,13109
s,11420
for,10122
vs,9295
dlrs,8850
it,8303
pct,7425
on,6712
lt,6302
from,6291
year,5950
cts,5805
is,5658
its,5563
that,5542
at,5203
by,5177
be,4746
u,4630
net,4563
with,4556
will,4510
was,4221
billion,4120
loss,4008
he,3850
has,3475
company,3430
would,3403
as,3342
an,3317
not,3150
inc,2959
bank,2792
but,2697
which,2691
shr,2659
this,2644
corp,2406
last,2402
are,2365
or,2344
trade,2341
oil,2338
share,2318
have,2305
were,2293
profit,2261
one,2231
had,2203
about,2077
market,2070
new,2019
two,2018
stock,1920
also,1909
shares,1895
they,1882
tonnes,1860
up,1768
march,1700
qtr,1657
prices,1651
january,1593
february,1593
sales,1591
revs,1565
per,1550
april,1525
group,1500
after,1498
been,1468
more,1421
may,1414
quarter,1386
co,1380
first,1369
rate,1367
japan,1365
than,1311
price,1308
government,1305
offer,1258
week,1257
three,1227
other,1216
exchange,1198
dollar,1180
we,1174
if,1139
agreement,1126
against,1115
over,1113
foreign,1110
today,1105
production,1098
rose,1096
tax,1096
international,1091
no,1077
ltd,1067
told,1062
could,1061
record,1060
note,1048
expected,1039
some,1036
their,1033
dlr,1029
rise,998
current,994
stg,991
five,969
interest,968
under,967
total,957
there,950
oper,940
month,937
world,928
all,926
rates,916
official,914
board,905
six,905
end,882
dividend,878
increase,872
earlier,864
earnings,855
growth,845
exports,840
export,836
banks,831
december,828
sale,821
added,819
wheat,797
between,796
unit,792
because,790
meeting,786
money,780
common,778
american,770
industry,765
cash,764
months,764
pay,752
department,752
into,750
four,741
made,739
countries,737
report,735
japanese,734
major,731
fell,729
buy,728
while,728
operations,713
spokesman,713
analysts,713
economic,711
now,704
business,704
ec,701
financial,700
officials,696
down,695
investment,694
any,690
when,689
stake,683
national,677
yen,673
compared,666
avg,666
lower,663
shrs,663
prior,663
cut,662
agreed,659
says,656
debt,650
acquisition,648
imports,647
further,645
due,643
years,642
president,642
should,638
around,634
sources,634
sugar,633
time,629
capital,623
nine,620
shareholders,619
central,619
federal,618
only,616
fall,614
companies,613
deficit,611
reserves,609
higher,608
since,605
currency,605
securities,605
gas,601
united,599
canada,598
west,596
includes,593
states,591
merger,590
div,588
general,588
k,587
sell,586
products,582
credit,582
before,581
gain,581
reported,580
trading,579
out,579
statement,576
period,568
next,563
state,562
commission,561
chairman,557
take,555
talks,549
markets,548
set,548
through,547
tender,545
ended,542
such,541
gold,541
coffee,535
policy,535
grain,533
i,529
minister,526
output,523
crude,523
based,522
annual,518
yesterday,517
surplus,517
figures,516
both,513
during,511
domestic,511
union,511
term,510
ago,508
high,506
expects,505
his,502
corn,501
day,499
announced,497
industries,497
assets,496
european,494
south,491
agriculture,491
system,486
results,486
plans,481
canadian,480
plan,479
did,479
fed,479
half,479
demand,476
same,475
split,475
average,471
level,467
marks,467
long,466
terms,463
producers,462
still,459
however,459
can,456
program,456
brazil,456
income,452
make,452
bid,451
loan,451
management,451
increased,450
subsidiary,448
likely,448
economy,448
qtly,447
owned,447
most,444
estimated,443
dealers,442
eight,441
energy,439
outstanding,438
recent,436
who,436
fiscal,434
early,432
well,432
t,431
sold,430
supply,430
continue,427
sets,427
firm,427
jan,426
previous,425
industrial,424
operating,422
forecast,422
non,422
off,421
traders,418
being,417
proposed,414
june,413
so,409
usda,409
part,408
purchase,408
costs,405
reuters,405
full,404
previously,403
second,401
seven,399
including,397
acquire,396
ministry,394
opec,393
value,392
treasury,392
each,388
mths,387
finance,386
sees,385
profits,385
bill,382
below,380
issue,379
petroleum,378
house,378
held,375
feb,375
soviet,372
china,372
another,371
help,370
plc,370
development,367
third,366
bought,366
country,365
cost,361
much,360
bpd,360
francs,359
our,358
committee,357
public,356
budget,355
reserve,353
levels,352
york,350
german,349
say,347
these,344
already,343
fourth,342
french,340
low,340
stocks,340
barrels,338
intervention,338
result,337
decline,337
payments,337
days,336
short,335
future,334
nations,334
pact,334
revised,333
point,333
do,331
proposal,331
association,331
account,330
funds,329
inflation,329
import,328
action,326
paris,326
include,324
very,323
change,322
might,321
until,321
september,318
private,317
crop,315
them,315
above,314
services,313
drop,313
m,312
move,311
losses,311
gulf,310
british,309
goods,309
those,308
what,307
loans,306
revenues,305
strong,305
asked,304
adjusted,302
less,301
control,300
acquired,299
approval,299
consumer,299
systems,298
farm,298
quarterly,298
completed,297
futures,297
l,295
declined,295
reduce,295
resources,293
banking,292
support,292
sector,292
community,291
close,290
prime,289
savings,289
possible,289
deal,287
pacific,287
base,287
baker,287
largest,286
approved,285
administration,285
noted,284
following,283
cocoa,282
making,282
taiwan,281
germany,281
council,281
amount,280
according,280
open,279
nil,279
late,278
subject,278
payable,278
show,278
secretary,278
service,277
target,276
monetary,276
effective,276
balance,275
takeover,274
several,274
basis,273
real,273
number,272
usair,272
here,271
members,271
reagan,271
final,270
additional,270
agency,269
excludes,269
extraordinary,269
trust,269
decision,269
comment,268
news,268
within,268
good,267
need,267
plant,267
holdings,266
must,266
many,266
london,266
executive,265
firms,265
analyst,264
n,263
data,261
given,261
large,261
does,260
accord,260
cents,260
buffer,259
farmers,257
product,255
whether,255
commercial,255
buying,255
back,254
gains,254
quota,253
line,252
contract,252
see,251
called,251
raised,248
later,248
france,248
conference,248
far,248
transaction,248
use,247
least,247
way,247
offered,247
currently,245
north,244
western,244
steel,243
weeks,242
issued,242
soybean,242
july,241
unchanged,241
raise,241
economists,241
past,239
put,238
used,237
give,236
division,236
remain,235
index,235
work,234
although,232
special,232
discontinued,232
investors,232
units,232
texas,232
paid,232
preferred,230
payout,230
quotas,230
mark,229
effect,229
tonne,228
area,228
f,228
certain,227
chief,227
exploration,227
available,226
charge,226
seen,226
own,226
among,226
holding,225
insurance,225
main,225
even,225
conditions,224
negotiations,224
just,224
delegates,224
natural,223
latest,223
bundesbank,223
areas,222
received,222
england,222
barrel,221
october,221
friday,220
marketing,219
present,219
gencorp,219
reached,218
free,218
member,217
changes,217
joint,217
washington,216
how,214
meet,214
without,214
signed,214
saudi,214
letter,213
sterling,213
food,213
senior,212
currencies,212
partners,212
pressure,212
selling,211
despite,211
fund,211
turnover,211
expect,210
court,210
australia,210
dutch,209
reduced,208
c,208
payment,208
stores,207
commerce,207
producer,207
commodity,207
measures,206
think,206
bills,206
cuts,206
worth,205
saying,204
november,204
showed,204
purchases,202
continued,201
holders,201
de,201
come,200
rising,200
equity,200
start,198
ministers,198
position,198
mine,198
provide,197
strike,196
distribution,196
britain,195
restructuring,195
near,195
estimate,195
respectively,194
bond,194
season,193
rights,193
statistics,193
hold,192
details,192
problems,191
congress,191
reporters,190
little,190
tomorrow,190
exporters,188
ending,188
equipment,188
better,188
pre,187
go,187
increases,187
financing,187
capacity,187
estimates,186
then,186
where,186
range,186
proposals,186
discount,186
spending,185
raises,185
daily,185
cyclops,185
twa,185
declared,184
led,184
dec,183
agreements,183
australian,183
ag,183
planned,182
name,182
buys,182
gatt,182
included,181
agricultural,181
issues,181
too,181
small,181
copper,181
sharp,180
tons,180
directors,178
leading,177
taken,177
return,177
study,177
tokyo,177
mining,177
re,176
rules,176
institute,176
pretax,176
order,176
get,175
date,175
bankers,175
workers,175
impact,174
seeking,174
sharply,174
manufacturing,174
office,174
director,172
investor,172
lending,172
morning,172
hit,172
computer,171
slightly,171
power,171
probably,171
dollars,171
lead,170
closed,170
reports,170
shipments,170
contracts,170
venture,170
initial,169
security,169
southern,169
weather,169
korea,168
b,168
figure,168
recently,168
maize,168
growing,167
city,167
ecuador,167
port,167
producing,166
shareholder,166
seek,166
scheduled,166
people,166
east,165
heavy,165
credits,165
receive,165
tariffs,165
europe,165
deposits,164
gross,164
life,164
right,163
america,163
addition,163
boost,163
situation,163
reduction,163
indonesia,163
offering,162
soon,162
response,162
research,162
local,162
again,161
rises,161
key,161
consumers,161
offers,161
allow,160
shipping,160
quoted,160
needed,160
adding,160
africa,160
ico,159
brazilian,158
ct,158
standard,158
review,157
vice,157
provision,157
retail,157
few,156
home,156
properties,156
interests,156
air,156
rubber,156
yet,155
become,155
refinery,155
fixed,155
technology,154
working,154
white,154
feet,153
began,153
repurchase,153
certificates,152
d,152
gave,152
liquidity,152
seasonally,151
falling,151
chemical,151
volume,150
consumption,150
force,150
limited,149
option,149
ounces,149
related,149
winter,149
yeutter,149
going,148
delivery,148
consider,148
disclosed,148
problem,148
call,148
shipment,147
regular,147
you,147
press,147
improved,147
increasing,145
like,145
cotton,145
acres,145
shearson,144
taking,144
want,144
mines,144
concern,143
class,143
partnership,143
organization,143
filing,143
undisclosed,142
place,142
significant,142
purolator,142
mid,141
decided,141
paper,141
reflect,141
taft,141
don,140
assistance,140
senate,140
forecasts,140
produced,138
form,138
continuing,138
mainly,138
options,138
orders,138
revenue,138
land,138
beef,138
bp,137
ships,137
august,136
periods,136
dixons,136
controls,136
overall,135
soybeans,135
keep,135
immediately,135
operation,134
caused,134
us,134
policies,134
performance,134
unemployment,134
businesses,133
shell,133
session,133
acquisitions,133
case,132
james,132
remaining,132
factors,132
bonus,132
corporation,132
express,131
earned,131
enough,131
discuss,130
arabia,130
shortage,130
totalled,130
lawson,129
believe,129
required,129
prospects,128
owns,128
oils,128
stability,128
northern,128
closing,128
plus,128
sea,128
ore,127
necessary,127
customer,127
outlook,127
india,127
dispute,127
information,127
pipeline,127
longer,126
potential,126
notes,126
swiss,126
interview,126
political,125
sells,125
ahead,125
efforts,125
remains,125
drilling,125
parent,125
palm,125
provided,124
changed,124
purchased,124
limit,124
nearly,124
rather,124
normal,123
act,123
greater,123
pound,123
means,122
competitive,122
unlikely,122
head,122
expansion,122
law,122
feed,122
almost,121
cable,121
able,121
guilders,121
improve,121
kong,121
diluted,121
aid,120
points,120
officer,120
difficult,120
charges,120
communications,120
italy,119
beginning,119
competition,119
similar,119
cent,119
health,119
makes,118
she,118
round,118
crowns,118
holds,118
overseas,118
extended,118
semiconductor,118
project,118
risk,118
combined,118
property,118
iran,118
piedmont,118
dropped,117
fuel,117
gnp,117
substantial,117
silver,117
chrysler,117
bags,116
gasoline,116
estate,116
existing,116
manager,116
crops,116
consolidated,116
top,116
provisions,116
investments,116
announcement,116
attempt,116
times,115
posted,115
monday,115
california,115
field,115
supplies,115
considering,114
buyout,114
e,114
took,114
hong,114
rejected,114
cattle,114
dividends,113
regulatory,113
war,113
colombia,113
expand,113
remained,113
bring,113
chicago,113
legislation,113
transactions,112
expenses,112
barley,112
ton,112
produce,112
light,111
convertible,111
versus,111
nation,111
improvement,111
add,111
wants,111
temporary,111
reach,111
fully,111
royal,110
monthly,110
gdp,110
economist,110
grow,110
developing,110
affected,110
unless,110
offset,109
prepared,109
source,109
lost,109
looking,109
principle,109
package,109
falls,109
minimum,109
accepted,109
rice,109
completes,108
measure,108
accounting,108
construction,108
best,108
icco,108
maintain,107
came,107
venezuela,107
spain,107
majority,106
flow,106
settlement,106
j,106
african,106
weekly,105
partly,105
cover,105
begin,105
singapore,105
started,105
post,104
former,104
released,104
coast,104
largely,104
corporate,104
find,104
television,104
deposit,103
telephone,103
coal,103
hard,103
growers,103
wednesday,103
activity,103
met,102
involved,102
lines,102
needs,102
subcommittee,102
important,102
question,102
electric,102
traded,102
john,102
bonds,102
view,101
considered,101
night,101
complete,101
accounts,101
equivalent,101
aimed,101
brown,101
great,101
h,101
harvest,101
transport,101
zealand,100
intent,100
percentage,100
band,100
g,100
instead,100
process,100
voting,100
authorities,100
provisional,100
ship,100
row,100
continental,100
particularly,99
left,99
calendar,99
hughes,99
r,99
caesars,99
warrants,98
telecommunications,98
nakasone,98
filed,98
vote,98
cause,98
mortgage,98
customers,98
damage,98
hutton,98
lyng,98
cooperation,97
discussions,97
newspaper,97
vegetable,97
accept,97
benefit,97
bureau,96
clear,96
specific,96
dealer,96
medical,96
run,96
acreage,96
cubic,95
reason,95
recovery,95
trend,95
cannot,95
malaysia,95
warner,95
spot,94
ends,94
st,94
yield,94
won,94
outside,94
stop,94
basic,94
failed,94
ccc,94
representative,94
hope,94
sumita,94
seamen,94
proceeds,93
cutting,93
ussr,93
ounce,93
preliminary,93
nippon,93
primary,93
grade,93
bids,93
fields,93
moves,92
taxes,92
wanted,92
try,92
ways,92
block,92
subsidies,92
survey,92
either,91
predicted,91
wholly,91
valued,91
reflected,91
effort,91
definitive,91
authority,91
facility,91
release,90
ecus,90
completion,90
chinese,90
direct,90
p,90
others,90
meat,90
activities,90
stood,90
building,90
adjustment,90
metal,90
benefits,90
chemlawn,90
employees,89
authorized,89
serious,89
parts,89
commodities,89
pending,89
cargo,89
aluminium,89
tin,89
application,89
volcker,89
coming,88
imported,88
electronics,88
allowed,88
raising,88
allied,88
series,88
dome,88
family,88
requirements,88
oecd,88
brought,87
speculation,87
requirement,87
face,87
miyazawa,87
airlines,87
operate,86
substantially,86
external,86
opened,86
progress,86
o,86
borrowing,86
borg,86
rest,85
stable,85
failure,85
helped,85
tuesday,85
giving,85
formed,85
calls,85
ruling,85
big,85
slow,85
using,85
yields,85
santa,85
single,84
agree,84
possibility,84
exclude,84
opening,84
interested,84
transportation,84
richard,84
johnson,84
representatives,84
old,83
worldwide,83
z,83
various,83
brothers,83
step,83
believes,83
items,83
amounts,83
entered,83
affect,83
facilities,83
baldrige,83
metals,83
believed,83
request,83
allegheny,83
kuwait,83
having,82
along,82
subsidiaries,82
together,82
hours,82
newly,82
retaliation,82
controlled,82
signs,82
employment,82
organisation,82
sosnoff,82
independent,81
thailand,81
laws,81
planning,81
follows,81
rand,81
drought,80
indicated,80
ab,80
enterprises,80
towards,80
houses,80
cpc,80
borrowings,80
mexico,80
restated,80
eastern,80
though,80
car,80
especially,80
region,80
hectares,80
named,79
equal,79
legal,79
afternoon,79
compares,79
projected,79
itself,79
middle,79
excess,79
ordinary,79
maximum,79
whole,79
eep,79
significantly,78
reform,78
positive,78
san,78
granted,78
reducing,78
look,78
relatively,78
turkey,78
sanctions,78
belgian,78
saw,78
poor,78
peru,78
manufacturers,78
arab,78
labour,78
cumulative,77
quality,77
buyers,77
rev,77
found,77
engineering,77
mar,77
averaged,77
video,77
groups,77
waste,77
planted,77
subsidy,77
franc,77
materials,77
moscow,77
river,76
street,76
immediate,76
done,76
prevent,76
intends,76
every,76
concerned,76
followed,76
crisis,76
am,76
ceiling,76
role,75
merge,75
david,75
chance,75
expectations,75
bancorp,75
negative,75
different,75
sec,75
trying,75
consideration,75
grew,75
medium,75
zinc,75
boston,75
access,74
paul,74
processing,74
writedown,74
exxon,74
asset,74
recorded,74
courier,74
strategy,74
takes,74
party,74
thursday,74
weak,74
freight,74
illinois,74
network,74
morgan,74
leaders,74
bushels,74
mean,73
successful,73
staff,73
suit,73
wholesale,73
negotiate,73
meetings,73
claims,73
lbs,73
parliament,72
resulting,72
strength,72
associated,72
broad,72
targets,72
grains,72
personal,72
urged,72
maker,72
vessels,72
malaysian,72
delayed,72
harper,72
iraq,72
registered,71
robert,71
wall,71
associates,71
know,71
smaller,71
al,71
miti,71
cyacq,71
amc,71
via,70
lehman,70
continues,70
relations,70
encourage,70
lot,70
summer,70
chemicals,70
generally,70
county,70
factor,70
negotiating,70
relief,70
supermarkets,70
test,69
privately,69
avoid,69
hopes,69
priced,69
water,69
ease,69
visit,69
quickly,69
projects,69
global,69
greece,69
build,69
once,69
speaking,69
sun,69
santos,69
fairchild,69
viacom,68
bulk,68
values,68
resulted,68
debentures,68
liabilities,68
remarks,68
transfer,68
yr,68
plants,68
offshore,68
minerals,68
alternative,68
originally,68
sign,68
willing,68
rains,68
refining,68
jobs,68
exceed,67
institutions,67
require,67
steady,67
totaled,67
ems,67
abroad,67
ohio,67
comments,67
lowered,67
motors,67
deputy,67
overnight,67
weekend,67
intended,67
iranian,67
ownership,66
behind,66
larger,66
underlying,66
forward,66
raw,66
pork,66
spring,66
excluding,66
moving,66
restrictions,66
expenditure,66
expressed,66
broadcasting,66
licences,66
confirmed,66
fe,66
csr,66
employers,66
bbl,66
governor,65
approve,65
suspended,65
bad,65
starting,65
accounted,65
sheet,65
aircraft,65
exported,65
fleet,65
ranging,65
storage,65
imf,65
gets,65
airline,65
iv,65
fact,64
steps,64
bilateral,64
designed,64
known,64
chips,64
programs,64
reporting,64
approximately,64
semiconductors,64
w,64
defense,64
wells,64
floor,64
intervene,64
away,64
condition,64
chip,64
confident,64
duty,64
smith,63
advanced,63
positions,63
anti,63
cargoes,63
gmt,63
paying,63
biggest,63
inventory,63
electronic,63
fee,63
planting,63
brokerage,63
guarantees,63
dry,62
stage,62
ports,62
island,62
warned,62
actions,62
stockholders,62
lynch,62
huge,62
soviets,62
push,62
sorghum,62
unfair,62
protectionist,62
reflecting,62
soft,62
tendered,62
auction,62
houston,61
appropriate,61
ratio,61
rumors,61
profitable,61
sectors,61
margins,61
determined,61
strategic,61
break,61
sweden,61
mills,61
sent,61
intervened,61
purposes,61
clayton,61
discussed,60
merrill,60
decide,60
material,60
depreciation,60
forced,60
depressed,60
anticipated,60
optimistic,60
housing,60
bass,60
entire,60
protection,60
participation,60
developments,60
affiliate,60
operators,60
starts,60
active,60
swedish,60
governments,60
argentine,60
dart,60
terminal,59
economies,59
speech,59
effects,59
acquires,59
fair,59
sought,59
technical,59
leader,59
imposed,59
principal,59
pesos,59
debate,59
wage,59
store,59
ability,59
spokeswoman,58
opposed,58
fats,58
stabilise,58
limits,58
commitment,58
talk,58
compromise,58
italian,58
minority,58
regional,58
practices,58
actual,58
philippines,58
follow,58
opposition,58
brokers,58
egypt,58
cold,58
enhancement,58
particular,58
statements,58
whose,58
indonesian,58
went,57
marine,57
shortfall,57
developed,57
operates,57
write,57
extend,57
declines,57
appears,57
tire,57
fire,57
lowest,57
hurt,57
course,57
represents,57
imperial,57
amstutz,57
missiles,57
miners,57
ups,56
diplomats,56
invest,56
declining,56
running,56
formal,56
suggested,56
thai,56
certificate,56
cross,56
pressures,56
michael,56
stabilize,56
toward,56
launched,56
turkish,56
stronger,56
introduced,56
surpluses,56
atlantic,56
emery,56
offices,55
placed,55
ask,55
progressive,55
premium,55
signal,55
determine,55
thought,55
quarters,55
stand,55
lake,55
machinery,55
create,55
balances,55
live,55
scale,55
pakistan,55
emergency,55
lb,55
contributed,55
side,55
highly,55
setting,55
alternatives,55
inra,55
original,54
asia,54
parties,54
nominal,54
cooperate,54
talking,54
develop,54
netherlands,54
movements,54
achieve,54
size,54
narrow,54
makers,54
separate,54
denied,54
trader,54
seeks,54
spanish,54
herrington,54
hands,53
components,53
miles,53
partner,53
republic,53
leave,53
highest,53
buyer,53
commitments,53
ferruzzi,53
care,53
foods,53
inventories,53
sides,53
moderate,53
resolve,53
gap,53
philippine,53
strongly,53
success,53
scheme,53
closely,53
risen,53
bankruptcy,53
committed,53
stimulate,53
citicorp,53
satisfactory,52
ve,52
approach,52
federation,52
him,52
differentials,52
ruled,52
latin,52
impose,52
duties,52
banker,52
adopted,52
indian,52
modest,52
circulation,52
pa,52
contribution,52
expire,52
shipped,52
renewed,52
threatened,52
harris,52
beet,52
sentiment,52
conservation,52
zone,51
published,51
enter,51
pension,51
mobil,51
exchequer,51
mineral,51
labor,51
intend,51
carry,51
upward,51
advances,51
y,51
petrobras,51
dumping,51
difficulties,51
bringing,51
nothing,51
structure,51
profitability,51
disease,51
william,51
portion,51
appeared,51
competitiveness,51
identified,51
affairs,51
deliveries,51
pdvsa,51
wide,50
mutual,50
confidence,50
icahn,50
bay,50
acquiring,50
ranges,50
provides,50
creditors,50
things,50
flat,50
hoped,50
refined,50
shift,50
allowing,50
exporting,50
reuter,50
ready,50
telecom,50
motor,50
kansas,50
specialty,50
military,50
reflects,50
algeria,50
qtrly,50
rep,50
florida,50
bell,50
opinion,50
threat,50
fresh,50
coins,50
cited,50
aide,50
rebate,50
throughout,49
really,49
iron,49
double,49
connection,49
votes,49
refused,49
doing,49
stated,49
congressional,49
fast,49
thus,49
cabinet,49
dairy,49
passed,49
pricing,49
ten,49
waiting,49
station,49
auto,49
rule,49
direction,49
api,49
comdata,49
traffic,49
drug,49
fob,48
argentina,48
circumstances,48
reorganization,48
shortly,48
adjustments,48
chancellor,48
shows,48
carried,48
mm,48
turn,48
covering,48
voted,48
curb,48
totalling,48
downward,48
attributed,48
reductions,48
noting,48
portfolio,48
protectionism,48
upon,48
hk,48
room,48
providing,48
decrease,48
zero,48
anything,48
enable,48
protect,48
proceed,48
initiative,48
established,48
resume,48
semi,48
coastal,48
eased,47
managers,47
disposal,47
idea,47
bidding,47
chase,47
possibly,47
extremely,47
reverse,47
movement,47
guarantee,47
hearing,47
representing,47
subordinated,47
debts,47
fallen,47
awarded,47
livestock,47
merged,47
internal,47
moment,47
sa,47
southwest,47
lloyds,47
lease,47
opportunity,47
traditional,47
asian,47
foster,47
hotel,47
grades,47
intention,47
barriers,46
example,46
supported,46
across,46
brings,46
decisions,46
martin,46
my,46
incentives,46
technologies,46
weakness,46
encouraging,46
combination,46
unadjusted,46
deals,46
commenting,46
exercise,46
defence,46
recover,46
seasonal,46
applied,46
matter,46
approvals,46
reference,46
justice,46
uk,46
establish,46
recession,46
studying,46
aviation,46
tool,46
los,46
belgium,46
ibc,46
workforce,46
gaf,46
diamond,46
tankers,46
unions,45
primarily,45
delay,45
louisiana,45
valley,45
indicate,45
getting,45
obligations,45
nuclear,45
aerospace,45
status,45
indicator,45
exchanges,45
bhp,45
protest,45
earn,45
rain,45
applications,45
fujitsu,45
severe,45
alone,45
woolworth,45
directly,45
social,45
dow,45
angeles,45
ringgit,45
branch,45
sept,44
switzerland,44
managing,44
center,44
books,44
regulations,44
recommended,44
preference,44
expanded,44
aluminum,44
panel,44
tea,44
counter,44
reasonable,44
normally,44
strikes,44
therefore,44
black,44
lift,44
afg,44
fundamentals,44
cane,44
extent,44
million,44
ventures,44
bushel,44
plantings,44
restaurants,44
zambia,44
jointly,43
usx,43
texaco,43
clearly,43
tenders,43
software,43
elaborate,43
nv,43
recommendation,43
retained,43
tariff,43
uncertainty,43
korean,43
introduction,43
rejects,43
radio,43
affecting,43
faced,43
sure,43
rainbow,43
interim,43
vessel,43
increasingly,43
focus,43
iowa,43
newmont,43
reynolds,43
except,43
feel,43
boosted,43
damaged,43
operated,43
sulphur,43
stressed,43
calif,43
renault,43
feedgrains,43
mart,43
improving,42
nearby,42
destinations,42
initially,42
entertainment,42
intermediate,42
attractive,42
utilities,42
lack,42
concerns,42
refiners,42
apply,42
warrant,42
list,42
goes,42
body,42
described,42
pounds,42
looks,42
retain,42
michigan,42
loading,42
wagner,42
kilo,42
grounds,42
bankamerica,42
fears,42
orange,42
bear,42
registrations,42
funding,42
levy,42
shamrock,42
williams,42
pesch,42
bally,42
seems,41
charged,41
opportunities,41
stay,41
advance,41
dauster,41
terminated,41
hostile,41
represented,41
calculated,41
sachs,41
annually,41
trans,41
mill,41
expires,41
deficits,41
businessmen,41
join,41
utility,41
kind,41
achieved,41
meant,41
alcan,41
obtain,41
advantage,41
tonight,41
manhattan,41
book,41
bolivia,41
hand,41
gained,41
returned,41
lme,41
propose,41
spread,41
objective,41
deficiency,41
pioneer,41
van,41
jersey,41
saudis,41
norstar,41
kilos,40
uruguay,40
ensure,40
extension,40
let,40
wait,40
evidence,40
float,40
midland,40
cereals,40
expense,40
eventually,40
goal,40
basin,40
retaliate,40
honeywell,40
showing,40
demands,40
executives,40
drain,40
province,40
conservative,40
fluctuations,40
agrees,40
club,40
requires,40
aim,40
widely,40
salomon,40
reaction,40
seriously,40
rio,40
norway,40
resorts,40
v,39
involving,39
submitted,39
replace,39
complex,39
comes,39
broadly,39
oilseeds,39
chain,39
meal,39
core,39
guilder,39
strengthen,39
george,39
ontario,39
fear,39
exporter,39
delhi,39
appreciation,39
cargill,39
pace,39
defend,39
faster,39
dealing,39
greek,39
aegean,39
individual,39
affiliates,39
cos,39
solution,39
moved,39
requested,39
halt,39
beneficial,39
est,39
hotels,39
refineries,39
got,39
begun,39
declares,39
cooper,39
disaster,39
interstate,39
card,39
wendy,39
earthquake,39
dot,38
wireless,38
never,38
partially,38
industrialised,38
listed,38
comprising,38
deferred,38
backlog,38
satisfied,38
origin,38
thirds,38
beyond,38
proven,38
always,38
informal,38
manufacturer,38
peak,38
peter,38
expanding,38
expensive,38
tight,38
jardine,38
container,38
sri,38
apr,38
merchandise,38
section,38
covered,38
repeated,38
siemens,38
nigeria,38
weight,38
dynamics,38
qualified,38
resolved,38
deadline,38
pushed,38
rainfall,38
economics,38
tough,38
centers,38
nor,38
favor,38
trump,38
kingdom,38
hongkong,38
ever,37
cars,37
speculated,37
swap,37
something,37
amendment,37
draft,37
portugal,37
revision,37
depending,37
alleged,37
embassy,37
shultz,37
backed,37
fairly,37
smelter,37
northwest,37
recommend,37
why,37
match,37
imbalance,37
narrowed,37
certainly,37
star,37
linked,37
rapeseed,37
built,37
rotterdam,37
spent,37
concerning,37
created,37
temperatures,37
jacobs,37
investigation,37
instruments,37
keeping,37
rapid,37
adequate,37
merchant,37
maturity,37
shown,37
distillate,37
la,37
leveraged,37
participants,37
indicators,37
tmoc,37
redstone,37
cases,36
meanwhile,36
charles,36
corrected,36
spend,36
shut,36
urges,36
pointed,36
mostly,36
agencies,36
felt,36
amounted,36
flows,36
stopped,36
grown,36
promote,36
depend,36
ford,36
km,36
flour,36
carryforward,36
tonnage,36
consortium,36
concentrate,36
receipt,36
safety,36
gives,36
located,36
owners,36
attend,36
toronto,36
multi,36
charter,36
file,36
turning,36
deutsche,36
speculative,36
arrangements,36
behalf,36
devaluation,36
collapse,36
owner,36
trends,36
leaving,36
columbia,36
heating,36
allis,36
conrac,36
miguel,36
election,36
ferry,36
klm,36
processors,35
distributed,35
bales,35
withdraw,35
outright,35
nov,35
proved,35
apparently,35
presented,35
discussion,35
reforms,35
save,35
red,35
environment,35
chartered,35
excessive,35
imbalances,35
textiles,35
maturing,35
bit,35
living,35
und,35
forces,35
hanson,35
becoming,35
announce,35
frozen,35
respond,35
chirac,35
joined,35
comprised,35
institutional,35
interbank,35
floating,35
approves,35
nova,35
broker,35
withdrawal,35
eligible,35
chalmers,35
lumber,35
complaint,35
concluded,35
cathay,35
delivered,34
disclose,34
produces,34
maintained,34
guaranteed,34
journalists,34
worst,34
favour,34
jordan,34
portland,34
resolution,34
clients,34
dallas,34
reasons,34
performing,34
containing,34
railway,34
hill,34
finished,34
bullish,34
ban,34
detailed,34
suspension,34
programme,34
customs,34
drill,34
purchasing,34
ll,34
southeast,34
delegate,34
restricted,34
bahrain,34
prospect,34
actively,34
coconut,34
affiliated,34
comparable,34
gm,34
consistent,34
contribute,34
prudential,34
rally,34
lambert,34
mercantile,34
surge,34
boliden,34
debit,34
schlumberger,34
occur,33
registration,33
scott,33
repayment,33
suggest,33
computers,33
converted,33
extra,33
remainder,33
causing,33
remove,33
favourable,33
rapidly,33
kenya,33
lanka,33
diversified,33
lose,33
seem,33
sluggish,33
influence,33
margin,33
conable,33
saturday,33
peabody,33
kept,33
uncertain,33
permit,33
depth,33
operator,33
quite,33
carryforwards,33
leaves,33
slide,33
settle,33
competing,33
managed,33
sufficient,33
exposure,33
battle,33
subsidized,33
textile,33
conditioned,33
doesn,33
breakdown,33
campaign,33
drexel,33
ill,33
delta,33
retirement,33
postings,33
proposes,33
sgl,33
nazer,33
unable,32
rival,32
ground,32
corporations,32
draw,32
attention,32
clearing,32
changing,32
ual,32
simply,32
considerable,32
hernandez,32
item,32
standards,32
heavily,32
faces,32
officially,32
zimbabwe,32
strait,32
citibank,32
na,32
importers,32
slight,32
ordered,32
homes,32
perhaps,32
canal,32
attack,32
mississippi,32
asa,32
att,32
notice,32
kuwaiti,32
broke,32
reiterated,32
wilson,32
industrialized,32
views,32
beans,32
reopen,32
golden,32
aggregate,32
champlin,32
rexnord,32
takeovers,32
republican,32
attacks,32
cbt,32
reed,32
bangladesh,32
mixed,32
man,32
glickman,32
lyons,32
eia,32
baird,32
oct,31
twice,31
int,31
identify,31
plaza,31
realty,31
realized,31
became,31
solve,31
resist,31
plastics,31
advised,31
boosting,31
media,31
indiana,31
arrangement,31
treatment,31
easing,31
variety,31
cheap,31
apparent,31
allowance,31
method,31
microchips,31
stands,31
ranged,31
cooperative,31
cheaper,31
termination,31
bull,31
el,31
decree,31
optimism,31
qatar,31
kiichi,31
calling,31
minus,31
packaging,31
maintenance,31
mannesmann,31
wood,31
delegation,31
lend,31
weaker,31
slowed,31
rebates,31
hrs,31
hog,31
represent,31
slaughter,31
georgia,31
guinness,31
champion,31
gelco,31
nigel,30
heller,30
enterprise,30
themselves,30
widespread,30
cautious,30
regarding,30
lucky,30
differences,30
lire,30
usage,30
curbs,30
appear,30
appeal,30
window,30
respect,30
swaps,30
flexible,30
pty,30
downturn,30
carrier,30
compete,30
ge,30
arrange,30
stations,30
tv,30
virtually,30
losing,30
advisory,30
firmed,30
bil,30
generale,30
responsible,30
poultry,30
waters,30
midnight,30
aware,30
branches,30
contained,30
hungary,30
harvested,30
cgct,30
snow,30
corning,30
answer,30
weighted,30
usually,30
delays,30
repay,30
criteria,30
conversion,30
outcome,30
matters,30
litigation,30
inflow,30
separately,30
attempts,30
phillips,30
laboratories,30
surprise,30
mts,30
autumn,30
noranda,30
iraqi,30
doubt,29
improvements,29
experts,29
serve,29
incentive,29
commonwealth,29
users,29
boards,29
assistant,29
actually,29
prompt,29
restructure,29
works,29
formally,29
ivory,29
ghana,29
des,29
job,29
environmental,29
unknown,29
presidential,29
decides,29
myers,29
peking,29
finding,29
massive,29
controlling,29
permanent,29
pass,29
slower,29
daniel,29
yasuhiro,29
rupees,29
stakes,29
mt,29
aside,29
northeast,29
ward,29
retaliatory,29
democratic,29
risks,29
tried,29
proportion,29
measured,29
disputes,29
drawing,29
headquarters,29
hudson,29
henley,29
otherwise,29
clark,29
facing,29
indirect,29
freeze,29
oklahoma,29
pursue,29
advisers,29
grant,29
liquid,29
acceptable,29
stance,29
asking,29
denmark,29
jim,29
audio,29
upper,29
self,29
itc,29
undersecretary,29
resource,29
burnham,29
lawmakers,29
momentum,29
poehl,29
sunflower,29
vital,29
stoltenberg,29
sen,29
coin,29
franklin,29
publicly,28
begins,28
relative,28
costa,28
occidental,28
switched,28
headed,28
chapter,28
goldman,28
volumes,28
attributable,28
grading,28
referring,28
fundamental,28
countertrade,28
drive,28
often,28
flexibility,28
expired,28
suffered,28
lifted,28
cif,28
announcing,28
chances,28
dependence,28
aggressive,28
presence,28
centre,28
partial,28
incurred,28
compensate,28
repurchases,28
discovery,28
slowing,28
door,28
load,28
thing,28
poland,28
gy,28
green,28
healthy,28
consuming,28
play,28
creditor,28
unsolicited,28
ha,28
timing,28
appropriations,28
expiration,28
expecting,28
lenders,28
donald,28
barge,28
content,28
moore,28
cuba,28
harcourt,28
recapitalization,28
platinum,28
diagnostic,28
prt,28
powers,27
slipped,27
elected,27
howard,27
reaching,27
pillsbury,27
runs,27
xon,27
jumped,27
amoco,27
understanding,27
acting,27
formerly,27
x,27
bra,27
kanon,27
fight,27
burden,27
determination,27
me,27
spa,27
polled,27
sum,27
lee,27
corrects,27
replied,27
holder,27
malcolm,27
bottom,27
recommendations,27
excluded,27
schedule,27
balanced,27
par,27
broken,27
widened,27
allows,27
newspapers,27
segment,27
priority,27
lira,27
difference,27
tell,27
inadequate,27
deregulation,27
democrat,27
receiving,27
heinz,27
jobless,27
distributor,27
expenditures,27
fine,27
written,27
moisture,27
extensive,27
indications,27
belief,27
putting,27
oilseed,27
welcomed,27
failing,27
questions,27
returns,27
gcc,27
conflict,27
repayments,27
quebec,27
sight,27
stabilisation,27
methods,27
effectively,27
disappointed,27
mulford,27
sunday,27
willingness,27
ecu,27
automotive,27
occurred,27
district,27
scientific,27
marked,27
invited,27
esso,27
encouraged,27
shanghai,27
midwest,27
norwegian,27
insured,27
predict,27
jones,27
revlon,27
stanley,27
petro,27
princeville,27
shoe,26
formation,26
cie,26
hike,26
king,26
climbed,26
undervalued,26
liability,26
warning,26
appointed,26
entitled,26
fifth,26
alberta,26
gradual,26
reliance,26
walter,26
guidelines,26
warburg,26
surprised,26
indication,26
violations,26
rank,26
suspend,26
projections,26
employs,26
extends,26
explore,26
cyl,26
arm,26
writedowns,26
interior,26
rica,26
type,26
slump,26
supports,26
hour,26
degrees,26
trees,26
geneva,26
inter,26
adverse,26
happen,26
elsewhere,26
restore,26
capel,26
firmer,26
easier,26
philadelphia,26
conducted,26
del,26
closure,26
handling,26
challenge,26
barney,26
generate,26
convinced,26
finland,26
decreased,26
comprehensive,26
pik,26
huckaby,26
seaway,26
lp,26
mhi,26
redundancies,26
fees,26
adopt,26
underground,26
railroad,26
purpose,26
smc,26
engine,26
cenergy,26
weinberger,26
hoechst,26
xuto,26
supplier,25
publications,25
balladur,25
dean,25
numbers,25
succeed,25
experience,25
virginia,25
auditors,25
assumption,25
unilever,25
damages,25
unspecified,25
royalty,25
tenneco,25
address,25
tighten,25
coupled,25
phase,25
consecutive,25
urging,25
nickel,25
sumitomo,25
depends,25
mitsubishi,25
southwestern,25
aims,25
du,25
parliamentary,25
whites,25
seemed,25
fuels,25
disputed,25
sense,25
visible,25
averaging,25
jacques,25
adds,25
implement,25
practice,25
nationwide,25
pick,25
colorado,25
physical,25
residents,25
guaranty,25
bonn,25
considers,25
emirates,25
necessarily,25
reviewing,25
microchip,25
commerzbank,25
divided,25
acre,25
agenda,25
alaska,25
link,25
friendly,25
atpc,25
manufactured,25
lay,25
exact,25
pizza,25
thomas,25
scope,25
importance,25
kodak,25
arabian,25
tanker,25
juice,25
wti,25
keating,25
epac,25
approached,25
norcros,25
meters,24
soared,24
bancshares,24
super,24
liquids,24
explained,24
informed,24
heart,24
universal,24
freedom,24
introduce,24
tobacco,24
reject,24
cereal,24
manufactures,24
trillion,24
crucial,24
urge,24
officers,24
feasibility,24
lowering,24
climate,24
pushing,24
petrol,24
pledged,24
rigs,24
cartel,24
minorities,24
worked,24
cement,24
passenger,24
foot,24
animal,24
structural,24
quick,24
politically,24
prove,24
boosts,24
ascs,24
drilled,24
suffer,24
settled,24
postponed,24
bearing,24
degree,24
ambassador,24
dependent,24
deterioration,24
petrochemical,24
comparison,24
commissioner,24
triggered,24
miller,24
secondary,24
montreal,24
oppenheimer,24
controversial,24
sweet,24
crown,24
neither,24
excellent,24
mitsui,24
costly,24
halted,24
basically,24
supplied,24
table,24
lbo,24
regulators,24
utah,24
wages,24
graphics,24
discovered,24
lawsuit,24
employed,24
buenos,24
aires,24
dan,24
walker,24
consensus,24
gao,24
resigned,24
edelman,24
subroto,24
petition,24
rospatch,24
insider,24
consent,24
swire,24
harvesting,23
appeals,23
divest,23
completely,23
ocean,23
fail,23
simon,23
intentions,23
ici,23
giant,23
exceeded,23
benchmark,23
acceptance,23
suppliers,23
transferred,23
respective,23
liquidating,23
else,23
consultations,23
premiums,23
compensation,23
eliminate,23
design,23
launch,23
defined,23
permits,23
heard,23
roughly,23
servicing,23
summit,23
restrictive,23
bache,23
watanabe,23
participating,23
elders,23
closer,23
divisions,23
congressmen,23
trip,23
societe,23
authorised,23
winds,23
navy,23
react,23
event,23
metropolitan,23
participate,23
accepts,23
electrical,23
publishing,23
obtained,23
negotiators,23
prompted,23
contain,23
acknowledged,23
opens,23
recovered,23
steep,23
steadily,23
exceeding,23
crushers,23
allocated,23
withdrawn,23
spur,23
yugoslav,23
shipbuilding,23
nevada,23
broadcast,23
damaging,23
microwave,23
atlanta,23
sealy,23
edward,23
assuming,23
akzo,23
sound,23
ic,23
responded,23
rbd,23
discussing,23
certs,23
mergers,23
roberts,23
hanover,23
carrying,23
edible,23
pratt,23
contact,23
unavailable,23
provinces,23
carolina,23
marginal,23
team,23
neutral,23
oats,23
truck,23
janeiro,23
assays,23
alusuisse,23
booked,22
midday,22
statistical,22
somewhat,22
circuit,22
thatcher,22
objections,22
minnesota,22
brands,22
carefully,22
favorable,22
carl,22
handle,22
membership,22
emerge,22
importing,22
milling,22
adversely,22
turned,22
unanimously,22
probable,22
yearly,22
gone,22
university,22
institution,22
desire,22
adjust,22
decade,22
helping,22
matheson,22
provisionally,22
herald,22
maintaining,22
maekawa,22
aggressively,22
extending,22
fish,22
ivorian,22
warships,22
prevailing,22
equally,22
recurring,22
principles,22
indirectly,22
ongoing,22
integrated,22
forecasting,22
sessions,22
inflationary,22
pickens,22
exchanged,22
restraint,22
glass,22
struck,22
civil,22
thousands,22
basket,22
fruit,22
satoshi,22
valid,22
cleared,22
speed,22
restrict,22
enhance,22
venezuelan,22
delaware,22
hundreds,22
citing,22
traditionally,22
vehicles,22
goodyear,22
summary,22
agent,22
doubled,22
consolidation,22
sudan,22
lowers,22
coarse,22
brackets,22
awb,22
drastic,22
proceedings,22
rental,22
ice,22
iea,22
mint,22
bancroft,22
qintex,22
pharmaceuticals,22
encor,22
westminster,22
holden,22
gates,22
wickes,22
temporao,21
reluctant,21
distribute,21
fidelity,21
upland,21
rd,21
bearish,21
temporarily,21
colombian,21
minstar,21
delegations,21
wet,21
household,21
critical,21
jose,21
license,21
oxide,21
gradually,21
pressing,21
impossible,21
writeoff,21
chile,21
commented,21
communist,21
sustained,21
yielding,21
rumours,21
farms,21
oppose,21
arranged,21
offsetting,21
processed,21
creating,21
bulletin,21
chamber,21
entirely,21
hamburg,21
unusually,21
proceeding,21
shelf,21
illegal,21
denominated,21
keen,21
westinghouse,21
revaluation,21
kidder,21
durum,21
channel,21
missouri,21
honduras,21
rebound,21
louis,21
wish,21
ii,21
haven,21
picture,21
volatility,21
comply,21
send,21
uae,21
examine,21
brief,21
your,21
looked,21
hillards,21
sellers,21
accident,21
killed,21
mechanism,21
petroleos,21
formula,21
adoption,21
quaker,21
mediterranean,21
crudes,21
pennsylvania,21
dudley,21
pence,21
supreme,21
bidders,21
backing,21
airport,21
clercq,21
reduces,21
forest,21
lloyd,21
signup,21
dakota,21
jack,21
amended,21
maryland,21
carbide,21
henderson,21
departments,21
uranium,21
individuals,21
entity,21
sprinkel,21
factory,21
ultimately,21
default,21
tallow,21
spin,21
mthly,21
disclosure,21
ex,21
privatisation,21
utilicorp,21
promising,21
upturn,21
tests,21
lukman,21
bayou,21
kwacha,21
missile,21
register,21
dropping,21
gallon,21
harbour,21
dead,21
ortner,21
retailers,21
durable,21
marines,21
mulroney,21
obtaining,20
aug,20
generated,20
amusements,20
reply,20
continuous,20
strengthening,20
arms,20
hikes,20
careful,20
financed,20
exception,20
implemented,20
leigh,20
pemberton,20
relationship,20
assurance,20
brand,20
marathon,20
lawrence,20
mca,20
acceptances,20
advisor,20
claim,20
danger,20
ran,20
casualty,20
emphasis,20
pattern,20
friction,20
yugoslavia,20
jump,20
badly,20
english,20
elections,20
danish,20
smelting,20
blamed,20
finally,20
sensitive,20
borrowers,20
contrast,20
upwards,20
emerged,20
dealings,20
ami,20
usa,20
alan,20
fla,20
dated,20
protein,20
lord,20
engaged,20
negotiation,20
lows,20
tied,20
baltic,20
philips,20
amid,20
brussels,20
replaced,20
establishing,20
turnaround,20
nature,20
scrap,20
foreigners,20
lifting,20
banque,20
distance,20
front,20
trades,20
pays,20
basf,20
philip,20
luxembourg,20
unusual,20
hole,20
foundation,20
proposing,20
barclays,20
redeem,20
zones,20
heritage,20
closes,20
stearns,20
true,20
lindner,20
plains,20
bidder,20
adviser,20
frost,20
century,20
banco,20
rich,20
sharing,20
assess,20
stick,20
links,20
memory,20
testimony,20
sown,20
sao,20
multilateral,20
broader,20
coverage,20
residential,20
bbls,20
receives,20
debtor,20
promised,20
elevator,20
pharmaceutical,20
onto,20
ameritrust,20
bound,20
telegraph,20
drawn,20
rail,20
horizon,20
icc,20
lear,20
symbion,20
pumping,20
airways,20
hormuz,20
czarnikow,20
riyal,20
riyals,20
auctions,20
zico,20
calny,20
transamerican,20
iwc,20
fit,19
exercisable,19
forms,19
exchangeable,19
treasurer,19
preparing,19
wisconsin,19
yearend,19
pro,19
predicts,19
strengthened,19
sciences,19
goals,19
contingent,19
totally,19
drew,19
implementation,19
secured,19
discounts,19
campbell,19
blocked,19
israel,19
cyprus,19
conditional,19
specify,19
intelligence,19
studies,19
offs,19
puts,19
maturities,19
involve,19
difficulty,19
personnel,19
administrative,19
placement,19
subsequent,19
expectation,19
trigger,19
boycott,19
islands,19
austria,19
tech,19
tension,19
issuing,19
nec,19
sand,19
bullion,19
placer,19
conclusion,19
reaffirmed,19
predictions,19
targeted,19
category,19
proxy,19
becomes,19
attracted,19
exercised,19
premier,19
liberalisation,19
forcing,19
didn,19
troubled,19
supporting,19
corresponding,19
worried,19
regions,19
americans,19
argued,19
sixth,19
explosion,19
person,19
concentrated,19
announces,19
exploratory,19
highs,19
hoping,19
questioned,19
outlined,19
psbr,19
financially,19
correct,19
hutchison,19
rha,19
concessions,19
forum,19
easily,19
banner,19
pat,19
grants,19
depletion,19
discounted,19
voluntary,19
film,19
latter,19
blocks,19
southmark,19
rostenkowski,19
complaints,19
unicorp,19
soymeal,19
choice,19
magma,19
assume,19
severely,19
asks,19
brace,19
receipts,19
furniture,19
residual,19
gallons,19
patrick,19
tehran,19
pie,19
cook,19
diplomat,19
alvite,19
oilfield,19
bat,19
restored,18
switch,18
serves,18
evans,18
unleaded,18
history,18
whom,18
holmes,18
rallied,18
apart,18
roderick,18
hilton,18
satisfy,18
denis,18
insufficient,18
procedure,18
micro,18
manufacture,18
cpb,18
productivity,18
completing,18
appealed,18
article,18
pretty,18
none,18
requiring,18
warns,18
kenyan,18
happy,18
competitor,18
opposes,18
apparel,18
locations,18
minn,18
buyback,18
mind,18
conduct,18
guinea,18
lewis,18
pl,18
worse,18
conagra,18
precious,18
wider,18
vulnerable,18
requests,18
underway,18
attract,18
presently,18
evaluate,18
suggests,18
preserve,18
wang,18
welcome,18
linking,18
meets,18
accused,18
writing,18
jungle,18
quoting,18
queensland,18
tropical,18
europeans,18
von,18
negotiated,18
administrator,18
contracted,18
awaiting,18
track,18
withdrew,18
propane,18
arbitrage,18
automobile,18
gabelli,18
itt,18
successfully,18
upham,18
stone,18
served,18
sarney,18
threaten,18
accumulated,18
detail,18
pcc,18
count,18
sowings,18
cftc,18
park,18
reversed,18
responding,18
specifically,18
greenmail,18
pantera,18
fitzwater,18
sims,18
flag,18
entities,18
sloane,18
solid,18
outflow,18
montagu,18
advertisement,18
snyder,18
owens,18
crushing,18
cds,18
deak,18
anacomp,18
brian,18
eastman,18
records,18
mellon,18
confirmation,18
permission,18
beverage,18
cooperatives,18
olein,18
norfolk,18
acid,18
husky,18
slowdown,18
sheikh,18
enrollment,18
nestle,18
mcivor,18
doubts,17
bean,17
plunged,17
committees,17
gould,17
allocations,17
edouard,17
reviewed,17
permitted,17
jr,17
restaurant,17
signals,17
unocal,17
oregon,17
suburban,17
ibm,17
upcoming,17
gaviria,17
relating,17
elect,17
border,17
equitable,17
dominican,17
tightening,17
ideas,17
telling,17
persuade,17
ctc,17
fomc,17
absence,17
factories,17
electricity,17
education,17
consulting,17
violating,17
bloc,17
ottawa,17
sugarcane,17
emerging,17
sparked,17
avana,17
document,17
outflows,17
invested,17
heads,17
secure,17
merchants,17
associate,17
widening,17
pleased,17
maybe,17
pesetas,17
feared,17
involves,17
confirm,17
troops,17
naval,17
suffering,17
bonuses,17
douglas,17
licenses,17
binding,17
breaking,17
farmer,17
space,17
joining,17
planes,17
briefing,17
coordination,17
escort,17
usual,17
cap,17
promise,17
ecuadorean,17
avert,17
documents,17
poison,17
feels,17
deep,17
doubtful,17
chipmakers,17
incoming,17
tesco,17
sunflowerseed,17
algerian,17
attitude,17
win,17
repair,17
constant,17
accrued,17
leasing,17
narragansett,17
dismissed,17
lessen,17
likelihood,17
bridge,17
mideast,17
refiner,17
criticism,17
argue,17
organisations,17
adsteam,17
pacts,17
accelerate,17
generic,17
depended,17
organizations,17
dole,17
mile,17
beghin,17
sanwa,17
plantations,17
ties,17
unsuccessful,17
severance,17
posting,17
triangle,17
fill,17
pennzoil,17
competitors,17
communique,17
connecticut,17
drafting,17
enforcement,17
bu,17
diesel,17
allocation,17
mission,17
portuguese,17
irish,17
injunction,17
healthcare,17
analysis,17
tvx,17
roll,17
mountain,17
standstill,17
seed,17
bauxite,17
gardner,17
unilateral,17
bayer,17
anglo,17
casino,17
governors,17
rating,17
victor,17
navigation,17
quake,17
whatever,17
sprint,17
fitness,17
rmj,17
ultramar,17
eagle,17
renouf,17
endotronics,17
transamerica,17
baht,17
icn,17
mr,16
domestically,16
francaise,16
concerted,16
regulation,16
carson,16
arranging,16
chevron,16
rothschild,16
replacement,16
allies,16
bourse,16
issuance,16
salary,16
dominant,16
discoveries,16
grisanti,16
attending,16
valuation,16
strict,16
climb,16
cities,16
shortages,16
motion,16
coupon,16
heading,16
entering,16
implications,16
pipe,16
anger,16
placements,16
integration,16
spotlight,16
notably,16
amounting,16
papandreou,16
concession,16
procedures,16
mobile,16
sydney,16
resale,16
uses,16
tensions,16
fired,16
component,16
imminent,16
slash,16
licensing,16
confirms,16
message,16
perception,16
importer,16
conglomerate,16
winterkill,16
tom,16
tighter,16
weakened,16
drops,16
afford,16
yards,16
taxation,16
advise,16
dwt,16
quiet,16
suggesting,16
publishers,16
triton,16
consist,16
hogs,16
bow,16
prefer,16
inquiry,16
gephardt,16
ireland,16
antitrust,16
shopping,16
realistic,16
road,16
precise,16
aids,16
transmission,16
edge,16
joe,16
carter,16
holiday,16
alumina,16
olson,16
stress,16
sir,16
shipowners,16
slack,16
schillings,16
covers,16
morocco,16
disposition,16
elimination,16
amo,16
bangemann,16
calm,16
heyman,16
assumed,16
kay,16
rural,16
arco,16
redemption,16
seipp,16
arbitration,16
chi,16
mueller,16
fnv,16
guardian,16
judge,16
advisors,16
fhlbb,16
allen,16
arango,16
builders,16
pc,16
polaroid,16
ucpb,16
striking,16
darman,16
pont,16
plywood,16
version,16
roach,16
krupp,16
mitchell,16
fcoj,16
decoupling,16
someone,16
grace,16
pepsico,16
unrest,16
metex,16
crosby,16
echlin,16
audi,16
nino,16
cra,16
comalco,16
routine,15
butter,15
margaret,15
electro,15
weakening,15
removed,15
federated,15
counties,15
evaluation,15
margoshes,15
witter,15
recognition,15
henry,15
jorio,15
cocoas,15
revises,15
pursuant,15
thinking,15
panama,15
reversal,15
switching,15
repeal,15
aggregates,15
idle,15
selected,15
laid,15
hkg,15
operational,15
yulo,15
award,15
seoul,15
ethanol,15
monopoly,15
mounting,15
abandoned,15
ronald,15
passage,15
accelerated,15
stem,15
stepped,15
testing,15
libya,15
considerably,15
aspects,15
athens,15
unacceptable,15
bases,15
obviously,15
inch,15
population,15
danforth,15
focused,15
differential,15
biotechnology,15
papua,15
conclude,15
mclean,15
rated,15
quantity,15
pegged,15
dates,15
deliver,15
declaration,15
fiber,15
objectives,15
credibility,15
centres,15
establishment,15
parallel,15
trouble,15
tamura,15
oman,15
limiting,15
sites,15
pill,15
timber,15
jakarta,15
bigger,15
spokesmen,15
availability,15
dinars,15
inflows,15
comparisons,15
lesser,15
dramatic,15
reality,15
essential,15
injection,15
paddy,15
frank,15
elements,15
quest,15
bob,15
citrus,15
sour,15
bag,15
unclear,15
colonial,15
oriented,15
fort,15
cleveland,15
advertising,15
utilization,15
lincoln,15
carriers,15
dominion,15
patents,15
threats,15
precision,15
challenges,15
slowly,15
eliminated,15
clauses,15
socialist,15
penney,15
transfers,15
efficiency,15
efficient,15
surface,15
backs,15
sized,15
pier,15
blood,15
lifetime,15
consists,15
fabrics,15
surrounding,15
lakes,15
aided,15
caution,15
generating,15
downwards,15
awards,15
claimed,15
rescheduling,15
comparative,15
greatest,15
lots,15
acted,15
pump,15
troy,15
trapped,15
preussag,15
peseta,15
possibilities,15
resort,15
suitor,15
siegler,15
kaiser,15
mercury,15
exempt,15
nppc,15
chem,15
revolving,15
types,15
senator,15
passengers,15
oak,15
haggard,15
reviews,15
ftc,15
train,15
cinema,15
vining,15
supertanker,15
cbi,15
hiram,15
nogales,15
varity,15
pinola,15
standing,14
hundred,14
thousand,14
superior,14
exclusive,14
cawl,14
fixing,14
minneapolis,14
mob,14
terminate,14
files,14
srd,14
sometime,14
bruce,14
foresee,14
indicates,14
alaskan,14
stabilizing,14
accords,14
favoured,14
anticipates,14
cardenas,14
disrupt,14
cutbacks,14
warm,14
combustion,14
devices,14
supermarket,14
murray,14
purchasers,14
splits,14
sort,14
principally,14
combat,14
downs,14
seat,14
preventing,14
leases,14
brusca,14
sizeable,14
easy,14
arising,14
machines,14
language,14
subsequently,14
earmarked,14
farming,14
vehicle,14
attempted,14
frankfurt,14
fluctuate,14
maintains,14
assist,14
liberal,14
potentially,14
intervenes,14
successive,14
enquiries,14
location,14
wind,14
violation,14
attacked,14
porsche,14
hedging,14
salvador,14
madagascar,14
maritime,14
denies,14
speculators,14
ethylene,14
code,14
returning,14
warehouse,14
salvage,14
understood,14
engage,14
moratorium,14
managua,14
attended,14
lifts,14
route,14
minute,14
garcia,14
lived,14
tone,14
defensive,14
